
#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03N2U1MTFmNi0wNjgyLTQxZDMtYTg0MC03NjU2NTY2YzBjY2E7b2JqZWN0SWQ9MjEwZTI0N2YtYjExNC00MGVkLWEzYjQtNTA0Yjc1NDI3MDg0O3N1YnNjcmlwdGlvbklkPTI2MDg2MjNlLTMyNmUtNDc2NS05NWZjLWI4ZjY1YTVjM2NiMTt0ZW5hbnRJZD1kMTk5MzkwMS1iYjUxLTQ5MmYtOGUwZC01NzJiMTM4NGYzYTY=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.acadapr will be created
  + resource "azurerm_container_app" "acadapr" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "acapoker-aca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "acapoker"
      + revision_mode                 = "Single"

      + dapr {
          + app_id       = (known after apply)
          + app_protocol = "http"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = false
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/azuredocs/containerapps-helloworld:latest"
              + memory            = "0.5Gi"
              + name              = "acapoker-aca"
            }
        }
    }

  # azurerm_container_app_environment.acadapr will be created
  + resource "azurerm_container_app_environment" "acadapr" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = (known after apply)
      + name                             = "acapoker-ace"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "acapoker"
      + static_ip_address                = (known after apply)
    }

  # azurerm_container_registry.acadapr will be created
  + resource "azurerm_container_registry" "acadapr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "acapokeracr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "acapoker"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_key_vault.acadapr will be created
  + resource "azurerm_key_vault" "acadapr" {
      + access_policy                 = [
          + {
              + object_id          = "210e247f-b114-40ed-a3b4-504b75427084"
              + secret_permissions = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + tenant_id          = "d1993901-bb51-492f-8e0d-572b1384f3a6"
            },
        ]
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "acapoker-KV"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "acapoker"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "d1993901-bb51-492f-8e0d-572b1384f3a6"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.aca-pass will be created
  + resource "azurerm_key_vault_secret" "aca-pass" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aca-pass"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.aca-url will be created
  + resource "azurerm_key_vault_secret" "aca-url" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aca-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.aca-user will be created
  + resource "azurerm_key_vault_secret" "aca-user" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aca-user"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.psql-pass will be created
  + resource "azurerm_key_vault_secret" "psql-pass" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "psql-pass"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.psql-user will be created
  + resource "azurerm_key_vault_secret" "psql-user" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "psql-user"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_log_analytics_workspace.acadapr will be created
  + resource "azurerm_log_analytics_workspace" "acadapr" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "eastus"
      + name                               = "acapoker-law"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "acapoker"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # azurerm_postgresql_flexible_server.acadapr will be created
  + resource "azurerm_postgresql_flexible_server" "acadapr" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + backup_retention_days         = (known after apply)
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "acadapr-psql"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "acapoker"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + version                       = "14"
      + zone                          = "2"
    }

  # azurerm_postgresql_flexible_server_database.acadapr will be created
  + resource "azurerm_postgresql_flexible_server_database" "acadapr" {
      + charset   = "utf8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "acadapr-db"
      + server_id = (known after apply)
    }

  # azurerm_resource_group.baseRG will be created
  + resource "azurerm_resource_group" "baseRG" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "acapoker"
    }

  # random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 30
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_uuid.acadapr will be created
  + resource "random_uuid" "acadapr" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Joey40, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*